Revit 2022 API
InCanvasControlData.ImagePath Property
 The path to the image file to be used. This must be an absolute path to a location on disk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2022
Syntax
C#
public string ImagePath { get; set; }
Visual Basic
Public Property ImagePath As String
	Get
	Set
Visual C++
public:
property String^ ImagePath {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The file format specified by imagePath is an unsupported format - only *.bmp files are supported.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.FileArgumentNotFoundException |  When setting this property: The file specified by imagePath doesn't exist.
See Also
InCanvasControlData Class
Autodesk.Revit.DB Namespace